PROB_LIST=[
    [   
        # 目前這筆的成交價是目前這筆的bid1
        [
            # bid1下一筆變成up, ask1下一筆變成up 
            [0.0019, 0.9978, 0.0022, 0],
            # bid1下一筆變成same, ask1下一筆變成up 
            [0.0009, 0.9761, 0.0239, 0],
            # bid1下一筆變成same, ask1下一筆變成same
            [0.9813, 0.3541, 0.6456, 0.0003],
            # bid1下一筆變成down, ask1下一筆變成same
            [0.0038, 0.0120, 0.9184, 0.0696],
            # bid1下一筆變成down, ask1下一筆變成down
            [0.0121, 0.0034, 0.9602, 0.0364]
        ],
        # 目前這筆的成交價是目前這筆的ask1
        [   
            # bid1下一筆變成up, ask1下一筆變成up 
            [0.0108, 0.0551, 0.9412, 0.0037],
            # bid1下一筆變成same, ask1下一筆變成up 
            [0.0034, 0.1318, 0.8618, 0.0064],
            # bid1下一筆變成same, ask1下一筆變成same
            [0.9826, 0.0004, 0.6843, 0.3154],
            # bid1下一筆變成down, ask1下一筆變成same
            [0.0011, 0, 0.0301, 0.9699],
            # bid1下一筆變成down, ask1下一筆變成down
            [0.0021, 0, 0.0018, 0.9982]
        ],
        # 目前這筆的成交價是目前這筆的bid2
        [
            # bid1下一筆變成up, ask1下一筆變成up 
            [0, 0, 0, 0],
            # bid1下一筆變成same, ask1下一筆變成up 
            [0.0030, 1, 0, 0],
            # bid1下一筆變成same, ask1下一筆變成same
            [0.6906, 0.9934, 0.0066, 0],
            # bid1下一筆變成down, ask1下一筆變成same
            [0.1357, 0.8876, 0.1124, 0],
            # bid1下一筆變成down, ask1下一筆變成down
            [0.1707, 0.9107, 0.0093, 0],
        ],
        # 目前這筆的成交價是目前這筆的ask2
        [   
            # bid1下一筆變成up, ask1下一筆變成up 
            [0.1570, 0, 0.0811, 0.9189],
            # bid1下一筆變成same, ask1下一筆變成up 
            [0.1146, 0, 0.1728, 0.8272],
            # bid1下一筆變成same, ask1下一筆變成same
            [0.7256, 0, 0.0078, 0.9922],
            # bid1下一筆變成down, ask1下一筆變成same
            [0.0014, 0, 0, 1],
            # bid1下一筆變成down, ask1下一筆變成down
            [0.0014, 0, 0, 1],
        ],
        # 目前這筆的成交價是目前這筆的bid3
        [
            # bid1下一筆變成up, ask1下一筆變成up 
            [0, 0, 0, 0],
            # bid1下一筆變成same, ask1下一筆變成up 
            [0, 0, 0, 0],
            # bid1下一筆變成same, ask1下一筆變成same
            [1, 1, 0, 0],
            # bid1下一筆變成down, ask1下一筆變成same
            [0, 0, 0, 0],
            # bid1下一筆變成down, ask1下一筆變成down
            [0, 0, 0, 0],
        ],
        # 目前這筆的成交價是目前這筆的ask3
        [   
            # bid1下一筆變成up, ask1下一筆變成up 
            [0, 0, 0, 0],
            # bid1下一筆變成same, ask1下一筆變成up 
            [0, 0, 0, 0],
            # bid1下一筆變成same, ask1下一筆變成same
            [1, 0, 0, 1],
            # bid1下一筆變成down, ask1下一筆變成same
            [0, 0, 0, 0],
            # bid1下一筆變成down, ask1下一筆變成down
            [0, 0, 0, 0],
        ]
    ],
    [
        # 目前這筆的成交價是目前這筆的bid1
        [
            [0.0005, 1, 0, 0],
            [0.0422, 0.4542, 0.5458, 0],
            [0.9069, 0.0004, 0.6843, 0],
            [0.0429, 0.3725, 0.6275, 0],
            [0.0075, 0.0222, 0.9556, 0.0222]
        ],
        # 目前這筆的成交價是目前這筆的ask1
        [
            [0.0062, 0.0909, 0.9091, 0],
            [0.0691, 0.0028, 0.7008, 0.2964],
            [0.8752, 0.0009, 0.6002, 0.3989],
            [0.0477, 0.0040, 0.6145, 0.3815],
            [0.0018, 0, 0, 1]
        ],
        # 目前這筆的成交價是目前這筆的mid
        [
            [0.0030, 1, 0, 0],
            [0.3120, 0.5824, 0.0029, 0.4174],
            [0.3741, 0.5368, 0, 0.4632],
            [0.3066, 0.4485, 0.0059, 0.5456],
            [0.0043, 0, 0, 1]
        ],
        # 目前這筆的成交價是目前這筆的bid2
        [
            [0, 0, 0, 0],
            [0, 0, 0, 0],
            [0.7273, 1, 0, 0],
            [0.0909, 1, 0, 0],
            [0.1818, 0.5, 0.5, 0]
        ],
        # 目前這筆的成交價是目前這筆的ask2
        [
            [0.1667, 0, 0, 1],
            [0.1111, 0, 0, 1],
            [0.7223, 0, 0, 1],
            [0, 0, 0, 0],
            [0, 0, 0, 0]
        ],
    ]
]