PROB_LIST=[
    [   
        # 目前這筆的成交價是目前這筆的bid1
        [
            # bid1下一筆變成up, ask1下一筆變成up 
            [0.0019, 0.9976, 0.0024, 0],
            # bid1下一筆變成same, ask1下一筆變成up 
            [0.0009, 0.9793, 0.0207, 0],
            # bid1下一筆變成same, ask1下一筆變成same
            [0.9812, 0.3539, 0.6458, 0.0003],
            # bid1下一筆變成down, ask1下一筆變成same
            [0.0038, 0.0095, 0.9205, 0.0700],
            # bid1下一筆變成down, ask1下一筆變成down
            [0.0122, 0.0030, 0.9609, 0.0361]
        ],
        # 目前這筆的成交價是目前這筆的ask1
        [   
            # bid1下一筆變成up, ask1下一筆變成up 
            [0.0109, 0.0557, 0.9406, 0.0037],
            # bid1下一筆變成same, ask1下一筆變成up 
            [0.0035, 0.1317, 0.8613, 0.0070],
            # bid1下一筆變成same, ask1下一筆變成same
            [0.9825, 0.0004, 0.6863, 0.3134],
            # bid1下一筆變成down, ask1下一筆變成same
            [0.0011, 0.0000, 0.0286, 0.9714],
            # bid1下一筆變成down, ask1下一筆變成down
            [0.0020, 0.0000, 0.0020, 0.9980]
        ],
        # 目前這筆的成交價是目前這筆的bid2
        [
            # bid1下一筆變成up, ask1下一筆變成up 
            [0, 0, 0, 0],
            # bid1下一筆變成same, ask1下一筆變成up 
            [0.0033, 1, 0, 0],
            # bid1下一筆變成same, ask1下一筆變成same
            [0.6927, 0.9928, 0.0072, 0],
            # bid1下一筆變成down, ask1下一筆變成same
            [0.1329, 0.8750, 0.1250, 0],
            # bid1下一筆變成down, ask1下一筆變成down
            [0.1711, 0.9029, 0.0971, 0],
        ],
        # 目前這筆的成交價是目前這筆的ask2
        [   
            # bid1下一筆變成up, ask1下一筆變成up 
            [0.1592, 0, 0.0777, 0.9223],
            # bid1下一筆變成same, ask1下一筆變成up 
            [0.1113, 0, 0.1944, 0.8056],
            # bid1下一筆變成same, ask1下一筆變成same
            [0.7265, 0, 0.0064, 0.9936],
            # bid1下一筆變成down, ask1下一筆變成same
            [0.0015, 0, 0, 1],
            # bid1下一筆變成down, ask1下一筆變成down
            [0.0015, 0, 0, 1],
        ],
        # 目前這筆的成交價是目前這筆的bid3
        [
            # bid1下一筆變成up, ask1下一筆變成up 
            [0, 0, 0, 0],
            # bid1下一筆變成same, ask1下一筆變成up 
            [0, 0, 0, 0],
            # bid1下一筆變成same, ask1下一筆變成same
            [1, 1, 0, 0],
            # bid1下一筆變成down, ask1下一筆變成same
            [0, 0, 0, 0],
            # bid1下一筆變成down, ask1下一筆變成down
            [0, 0, 0, 0],
        ],
        # 目前這筆的成交價是目前這筆的ask3
        [   
            # bid1下一筆變成up, ask1下一筆變成up 
            [0, 0, 0, 0],
            # bid1下一筆變成same, ask1下一筆變成up 
            [0, 0, 0, 0],
            # bid1下一筆變成same, ask1下一筆變成same
            [1, 0, 0, 1],
            # bid1下一筆變成down, ask1下一筆變成same
            [0, 0, 0, 0],
            # bid1下一筆變成down, ask1下一筆變成down
            [0, 0, 0, 0],
        ]
    ],
    [
        # 目前這筆的成交價是目前這筆的bid1
        [
            # bid1下一筆變成up, ask1下一筆變成up 
            [0.0009, 1, 0, 0],
            # bid1下一筆變成up, ask1下一筆變成same
            [0.2029, 0.4391, 0.5609, 0],
            # bid1下一筆變成same, ask1下一筆變成same
            [0.5844, 0.3218, 0.6782, 0],
            # bid1下一筆變成same, ask1下一筆變成down
            [0.2039, 0.3810, 0.6190, 0],
            # bid1下一筆變成down, ask1下一筆變成down
            [0.0079, 0, 1, 0]
        ],
        # 目前這筆的成交價是目前這筆的ask1
        [
            [0.0076, 0.1111, 0.8889, 0],
            [0.2769, 0.0031, 0.6942, 0.3028],
            [0.5182, 0.0033, 0.6225, 0.3742],
            [0.1956, 0.0043, 0.6190, 0.3766],
            [0.0017, 0, 0, 1]
        ],
        # 目前這筆的成交價是目前這筆的mid
        [
            [0.0034, 1, 0, 0],
            [0.3107, 0.5857, 0.0032, 0.4111],
            [0.3723, 0.5325, 0, 0.4675],
            [0.3087, 0.4409, 0.0064, 0.5527],
            [0.0049, 0, 0, 1]
        ],
        # 目前這筆的成交價是目前這筆的bid2
        [
            [0, 0, 0, 0],
            [0, 0, 0, 0],
            [0.6666, 1, 0, 0],
            [0.1667, 1, 0, 0],
            [0.1667, 0, 1, 0]
        ],
        # 目前這筆的成交價是目前這筆的ask2
        [
            [0.0910, 0, 0, 1],
            [0.1817, 0, 0, 1],
            [0.7223, 0, 0, 1],
            [0, 0, 0, 0],
            [0, 0, 0, 0]
        ],
    ]
]